Repository: MarioAlJim/genetic_algorithm
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Generation
es: Generación

source: Evaluated population
es: Población evaluada

source: Max FS
es: VA máximo

source: Best FS
es: Mejor VA

source: Average FS
es: VA promedio

source: Fitness score evolution
es: Evolución del valor de aptitud

source: Fitness Score (FS)
es: Valor de Aptitud (VA)

source: Fitness distribution per generation
es: Aptitud por generación

source: Fitness
es: Aptitud

source: Evaluation inputs
es: Entradas de la evaluación

source: Triangle Classification
es: Clasificación de Triángulos

source: One point
es: Un punto

source: Two point
es: Dos puntos

source: Uniform
es: Uniforme

source: Real number
es: Número real

source: Genetic Algorithm
es: Algoritmo Genético

source: Evaluation type
es: Tipo de evaluación

source: Algorithm
es: Algoritmo

source: Generations
es: Generaciones

source: Population size
es: Tamaño de la población

source: Chromosome length
es: Tamaño del cromosoma

source: Gen type
es: Tipo de gen

source: Selection type
es: Tipo de selección

source: Selection rate
es: Probabilidad de selección

source: Crossover type
es: Tipo de cruce

source: Mutation type
es: Tipo de mutación

source: Mutation rate
es: Probabilidad de mutación

source: Elite population rate
es: Porcentaje de población élite

source: Initial population
es: Población inicial

source: Selected population
es: Población seleccionada

source: Crossover population
es: Población cruzada

source: Mutated population
es: Población mutada

source: Random resetting
es: Reinicialización aleatoria

source: Random
es: Aleatorio

source: Steady state
es: Estado estacionario

source: Execution results
es: Resultados de ejecución

source: ABOUT
es: ACERCA DE

source: BiTe is intended to be a tool for those interested in search-based software testing (SBST) to experiment with the use of bio-inspired algorithms in the generation of test data, allowing them to know their behavior and performance through the experimentation with different parameters and configurations without the need to implement them manually.
es: BiTe está destinada a ser una herramienta para aquellos interesados en las pruebas de software basadas en búsqueda (SBST por sus siglas en inglés) para experimentar con el uso de algoritmos bioinspirados en la generación de datos de prueba, permitiéndoles conocer su comportamiento y rendimiento a través de la experimentación con diferentes parámetros y configuraciones sin necesidad de implementarlos manualmente.

source: A systematic literature mapping was conducted for the development of BiTe. Publishing the results of this mapping in an <a href="https://ieeexplore.ieee.org/document/10795575">article</a> that summarizes the findings and provides insights into the use of canonical bio-inspired algorithms in SBST.
es: Un mapeo sistemático de literatura fue realizado para el desarrollo de BiTe. Publicando los resultados de este mapeo en un <a href="https://ieeexplore.ieee.org/document/10795575">artículo</a> que resume los hallazgos y proporciona información sobre el uso de algoritmos bioinspirados canónicos en SBST.

source: <a href="https://github.com/MarioAlJim/genetic_algorithm">Here</a> you can find the source code of BiTe.
es: <a href="https://github.com/MarioAlJim/genetic_algorithm">Aquí</a> se puede encontrar el código fuente de BiTe.

source: Team members
es: Miembros del equipo

source: Number of individuals in each generation of the genetic algorithm.
es: Número de individuos en cada generación del algoritmo genético.

source: Number of iterations the genetic algorithm will run.
es: Número de iteraciones que ejecutará el algoritmo genético.

source: Percentage of individuals selected for reproduction in each generation.
es: Porcentaje de individuos seleccionados para la reproducción en cada generación.

source: Method used to combine genetic information from parents to produce offspring.
es: Método utilizado para combinar la información genética de los padres para producir descendencia.

source: Probability that a mutation will occur in a gene during reproduction.
es: Probabilidad de que se produzca una mutación en un gen durante la reproducción.

source: ENGLISH
es: INGLÉS

source: SPANISH
es: ESPAÑOL

source: Running the experiment, please wait...
es: Ejecutando el experimento, por favor espere...

source: Context
es: Contexto

source: Hover on
es: Pase el cursor sobre

source: Click or hover on
es: Haga clic o pase el cursor sobre

source: to get help
es: para obtener ayuda

source: Testing environment
es: Entorno de prueba

source: System selected for experimentation of test data generation.
es: Sistema seleccionado para la experimentación de generación de datos de prueba.

source: Algorithm selected for test data generation.
es: Algoritmo seleccionado para la generación de datos de prueba.

source: Algorithm settings
es: Configuración del algoritmo

source: Download report
es: Descargar reporte

source: The Triangle Classification problem consists of categorizing the type of triangle that is formed given the inputs (measurements of each side). Depending on the inputs the triangle can be classified into:
es: El problema de Clasificación de Triángulos consiste en categorizar el tipo de triángulo que se forma según las entradas (medidas de cada lado). Dependiendo de las entradas, el triángulo puede clasificarse en:

source: Scalene
es: Escaleno

source: Equilateral
es: Equilátero

source: Isosceles
es: Isósceles

source: Invalid
es: Inválido

source: Out of range
es: Fuera de rango

source: The Genetic Algorithm is a population algorithm based on biological evolution. The process followed by the algorithm is:
es: El Algoritmo Genético es un algoritmo poblacional basado en la evolución biológica. El proceso seguido por el algoritmo es:

source: Select the type of representation of the solution to be generated (real number, binary, permutation, or mixed).
es: Selecciona el tipo de representación de la solución a generar (número real, binario, permutación o mixto).

source: Initialize a population and evaluate it using the fitness function. A fitness function its a function that evaluates how well a potential solution meets its goals given a problem.
es: Inicializa una población y evalúala usando la función de aptitud. La función de aptitud evalúa qué tan bien una solución potencial cumple con los objetivos dados de un problema.

source: Apply elitism if indicated. Elitism consists in selecting a defined number of the best individuals in the current population and keep them intact until the next generation.
es: Aplica elitismo si se indica. El elitismo consiste en seleccionar un número definido de los mejores individuos de la población actual y conservarlos intactos hasta la siguiente generación.

source: Select some chromosomes (also called individuals) from the current population.
es: Selecciona algunos cromosomas (también llamados individuos) de la población actual.

source: Cross the selected individuals to create new individuals (children).
es: Cruza los individuos seleccionados para crear nuevos individuos (hijos).

source: Mutate some of the children.
es: Muta algunos de los hijos.

source: Evaluate the new population (children) using the fitness function.
es: Evalúa la nueva población (hijos) usando la función de aptitud.

source: Repeat the steps 3 to 7 until a standstill condition is known or a satisfactory solution is reached.
es: Repite los pasos del 3 al 7 hasta que se alcance una condición de parada o se obtenga una solución satisfactoria.

source: Execution analysis graphs
es: Gráficos de análisis de ejecución

source: The context and parameters indicated for the algorithm are represented in the following table:
es: El contexto y los parámetros indicados para el algoritmo se representan en la siguiente tabla:

source: The following graphs represent the execution analysis of the algorithm:
es: Las siguientes gráficas representan el análisis de ejecución del algoritmo:

source: Generated test data
es: Datos de prueba generados

source: The following table shows the execution data generated by the algorithm:
es: La siguiente tabla muestra los datos de ejecución generados por el algoritmo:

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Generated test cases
es: Casos de prueba generados

source: The following code belongs to the system under testing:
es: El siguiente código pertenece al sistema bajo prueba:

source: The test cases with the highest code coverage in the last generation were:
es: Los casos de prueba con mayor cobertura de código en la última generación fueron:

source: Run the algorithm to be able to visualize the results.
es: Ejecuta el algoritmo para poder visualizar los resultados.

source: Report
es: Reporte

source: Applied configuration
es: Configuración aplicada

source: System Under Testing
es: Sistema bajo prueba

source: Execute
es: Ejecutar

source: Apply
es: Aplicar

source: Definition
es: Definición

source: Number of individuals in each generation.
es: Número de individuos en cada generación.

source: Impact
es: Impacto

source: A larger size can improve diversity but increases computational cost.
es: Un tamaño mayor puede mejorar la diversidad pero incrementa el costo computacional.

source: Number of generations
es: Número de generaciones

source: Total number of iterations for the genetic algorithm.
es: Número total de iteraciones para el algoritmo genético.

source: More generations may improve results but increase execution time.
es: Más generaciones pueden mejorar los resultados pero aumentan el tiempo de ejecución.

source: Method used to select individuals for reproduction.
es: Método utilizado para seleccionar individuos para reproducción.

source: Affects convergence speed and genetic diversity.
es: Afecta la velocidad de convergencia y la diversidad genética.

source: Selects individuals randomly, promoting diversity but possibly reducing convergence speed.
es: Selecciona individuos aleatoriamente, promoviendo diversidad pero posiblemente reduciendo la velocidad de convergencia.

source: 1) A certain number of chromosomes (with good or high fitness scores) are selected from the new population. 2) These chromosomes replace a certain number of chromosomes (with low or poor fitness scores) from the previous population. 3) The rest of the population survives to the new generation.
es: 1) Se selecciona un cierto número de cromosomas (con buenas o altas puntuaciones de aptitud) de la nueva población. 2) Estos cromosomas reemplazan a un cierto número de cromosomas (con bajas o pobres puntuaciones de aptitud) de la población anterior. 3) El resto de la población sobrevive a la nueva generación.

source: Proportion of population selected for reproduction.
es: Proporción de la población seleccionada para reproducción.

source: Higher rates increase selective pressure, but too high may cause premature convergence.
es: Tasas más altas aumentan la presión selectiva, pero demasiado altas pueden causar convergencia prematura.

source: Method used to combine two parents to produce offspring.
es: Método utilizado para combinar dos padres y producir descendencia.

source: Determines how genetic material is mixed, influencing diversity.
es: Determina cómo se mezcla el material genético, influyendo en la diversidad.

source: 1) A crossover point is randomly selected. 2) Genes from that point onward are swapped between the two parent chromosomes. 3) This results in two offspring each carrying information from both parents.
es: 1) Se selecciona aleatoriamente un punto de cruce. 2) Los genes desde ese punto en adelante se intercambian entre los dos cromosomas padres. 3) Esto resulta en dos descendientes que portan información de ambos padres.

source: 1) k crossover points are randomly selected. 2) Genes between the k points are swapped between the parent chromosomes. 3) This results in two offspring each carrying information from both parents.
es: 1) Se seleccionan aleatoriamente k puntos de cruce. 2) Los genes entre esos puntos se intercambian entre los cromosomas padres. 3) Esto resulta en dos descendientes que portan información de ambos padres.

source: 1) Each gene is selected from either parent with equal probability. 2) This results in two offspring with random genes from the parents.
es: 1) Cada gen es seleccionado de cualquiera de los padres con igual probabilidad. 2) Esto resulta en dos descendientes con genes aleatorios de los padres.

source: Method used to introduce random variations in individuals.
es: Método utilizado para introducir variaciones aleatorias en los individuos.

source: Prevents premature convergence by exploring new solutions.
es: Previene la convergencia prematura explorando nuevas soluciones.

source: Changes the value of one or more genes to a random value within its domain.
es: Cambia el valor de uno o más genes a un valor aleatorio dentro de su dominio.

source: Probability of applying mutation to individuals.
es: Probabilidad de aplicar mutación a los individuos.

source: Higher rates explore more, but can destabilize the population.
es: Tasas más altas exploran más, pero pueden desestabilizar la población.

source: Proportion of the best individuals preserved to the next generation.
es: Proporción de los mejores individuos preservados para la siguiente generación.

source: Helps retain strong solutions but too high may reduce diversity.
es: Ayuda a conservar soluciones fuertes, pero un valor demasiado alto puede reducir la diversidad.

source: An unexpected error occurred. Please try again later.
es: Un error inesperado ocurrió. Por favor, inténtalo de nuevo más tarde.
